upload_performance_result/metrics/sglang/20260725/test_npu_qwen3_6_35b_a3b_1p_in3k5_out1k5_50ms.txt
memfabric_hybrid          1.0.8
sgl_kernel_npu            2026.6.1
sglang                    0.5.15.post2.dev687+gb98a577fb /sgl-workspace/sglang/python
sglang-router             0.3.2
torch                     2.10.0+cpu
torch_npu                 2.10.0
torchao                   0.9.0
torchaudio                2.10.0+cpu
torchvision               0.25.0+cpu
CANN: 9.0.0
transformers: 5.12.1
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20866, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/Qwen/Qwen3.6-35B-A3B', served_model_name=None, tokenizer=None, num_prompts=122, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3500, random_output_len=1500, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=122, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:20866/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20866, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/tmp/ShareGPT_V3_unfiltered_cleaned_split.json', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/Qwen/Qwen3.6-35B-A3B', served_model_name=None, tokenizer=None, num_prompts=122, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3500, random_output_len=1500, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=122, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 427000
#Output tokens: 183000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/122 [00:00<?, ?it/s]
  1%|          | 1/122 [01:04<2:10:30, 64.71s/it]
 14%|█▍        | 17/122 [01:04<04:45,  2.72s/it] 
 27%|██▋       | 33/122 [01:10<02:01,  1.36s/it]
 33%|███▎      | 40/122 [01:11<01:25,  1.04s/it]
 36%|███▌      | 44/122 [01:12<01:08,  1.15it/s]
 39%|███▊      | 47/122 [01:12<00:57,  1.31it/s]
 40%|████      | 49/122 [01:12<00:49,  1.48it/s]
 42%|████▏     | 51/122 [01:13<00:43,  1.64it/s]
 43%|████▎     | 53/122 [01:13<00:35,  1.92it/s]
 45%|████▌     | 55/122 [01:14<00:29,  2.27it/s]
 46%|████▌     | 56/122 [01:14<00:27,  2.40it/s]
 47%|████▋     | 57/122 [01:14<00:24,  2.64it/s]
 49%|████▉     | 60/122 [01:14<00:15,  3.88it/s]
 51%|█████     | 62/122 [01:15<00:16,  3.72it/s]
 52%|█████▏    | 63/122 [01:15<00:14,  4.01it/s]
 52%|█████▏    | 64/122 [01:15<00:13,  4.34it/s]
 54%|█████▍    | 66/122 [01:15<00:09,  5.69it/s]
 57%|█████▋    | 69/122 [01:15<00:07,  7.57it/s]
 59%|█████▉    | 72/122 [01:16<00:05,  9.91it/s]
 61%|██████▏   | 75/122 [01:16<00:03, 12.12it/s]
 63%|██████▎   | 77/122 [01:16<00:03, 12.46it/s]
 65%|██████▍   | 79/122 [01:16<00:04, 10.26it/s]
 67%|██████▋   | 82/122 [01:16<00:03, 11.33it/s]
 69%|██████▉   | 84/122 [01:17<00:06,  5.68it/s]
 70%|███████   | 86/122 [01:17<00:05,  6.75it/s]
 72%|███████▏  | 88/122 [01:18<00:04,  7.31it/s]
 74%|███████▍  | 90/122 [01:18<00:03,  8.45it/s]
 75%|███████▌  | 92/122 [01:18<00:03,  7.97it/s]
 77%|███████▋  | 94/122 [01:18<00:03,  8.19it/s]
 78%|███████▊  | 95/122 [01:18<00:03,  8.30it/s]
 81%|████████  | 99/122 [01:19<00:01, 12.27it/s]
 83%|████████▎ | 101/122 [01:19<00:03,  6.80it/s]
 84%|████████▍ | 103/122 [01:19<00:02,  8.17it/s]
 86%|████████▌ | 105/122 [01:20<00:02,  7.90it/s]
 88%|████████▊ | 107/122 [01:20<00:01,  9.54it/s]
 90%|█████████ | 110/122 [01:20<00:00, 12.10it/s]
 92%|█████████▏| 112/122 [01:20<00:01,  9.36it/s]
 93%|█████████▎| 114/122 [01:21<00:00,  8.06it/s]
 95%|█████████▌| 116/122 [01:21<00:00,  8.51it/s]
 97%|█████████▋| 118/122 [01:22<00:00,  4.06it/s]
 98%|█████████▊| 119/122 [01:22<00:00,  4.06it/s]
 98%|█████████▊| 120/122 [01:24<00:00,  2.11it/s]
100%|██████████| 122/122 [01:24<00:00,  2.73it/s]
100%|██████████| 122/122 [01:24<00:00,  1.45it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 122       
Successful requests:                     122       
Benchmark duration (s):                  84.40     
Total input tokens:                      427000    
Total input text tokens:                 427000    
Total generated tokens:                  183000    
Total generated tokens (retokenized):    176988    
Request throughput (req/s):              1.45      
Input token throughput (tok/s):          5059.26   
Output token throughput (tok/s):         2168.26   
Peak output token throughput (tok/s):    4119.00   
Peak concurrent requests:                122       
Total token throughput (tok/s):          7227.52   
Concurrency:                             106.94    
Accept length:                           3.09      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   73980.00  
Median E2E Latency (ms):                 74973.51  
P90 E2E Latency (ms):                    80347.04  
P95 E2E Latency (ms):                    81114.44  
P99 E2E Latency (ms):                    84036.11  
---------------Time to First Token----------------
Mean TTFT (ms):                          17128.35  
Median TTFT (ms):                        18459.98  
P90 TTFT (ms):                           26570.19  
P95 TTFT (ms):                           26636.26  
P99 TTFT (ms):                           26812.29  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.93     
Median TPOT (ms):                        37.41     
P90 TPOT (ms):                           45.99     
P95 TPOT (ms):                           48.09     
P99 TPOT (ms):                           51.25     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           37.93     
Median ITL (ms):                         25.27     
P90 ITL (ms):                            50.13     
P95 ITL (ms):                            53.35     
P99 ITL (ms):                            102.11    
Max ITL (ms):                            21428.31  
==================================================

# [collect_metrics] 文件原始修改时间: 2026-07-25 00:53:43